In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('data_m.csv')
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

#### Fill all NaN values with 0s

In [4]:
data.fillna(111)

      Name  Marks Grades
0  Priyang   98.0    111
1   Aadhya  111.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0    111
4   Parshv   90.0     AC
5   Mittal  111.0     BA
6  Archana   82.0     BB

#### Fill all NaN values with mean value

In [5]:
data=pd.read_csv('data_new.csv')
data.fillna(data.mean())

        City       Temp
0  Ahmedabad  34.000000
1      Anand  39.666667
2     Baroda  39.666667
3      Surat  40.000000
4      Delhi  39.666667
5   Banglore  45.000000

#### Fill all NaN elements in columns 'Marks' and 'Grades' With 97 and 'AA' respectively.

In [9]:
data=pd.read_csv('data_m.csv')

data.fillna({'Marks':97,'Grades':'AA'})

      Name  Marks Grades
0  Priyang   98.0     AA
1   Aadhya   97.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AA
4   Parshv   90.0     AC
5   Mittal   97.0     BA
6  Archana   82.0     BB

#### Propagate non-null values forward

In [24]:
data=pd.read_csv('data_new.csv')
data.fillna(method='ffill')

        City  Temp
0  Ahmedabad  34.0
1      Anand  34.0
2     Baroda  34.0
3      Surat  40.0
4      Delhi  40.0
5   Banglore  45.0

#### Propagate non-null values backward.

In [27]:
data.fillna(method='bfill')

        City  Temp
0  Ahmedabad  34.0
1      Anand  40.0
2     Baroda  40.0
3      Surat  40.0
4      Delhi  45.0
5   Banglore  45.0

#### inplace

In [31]:
df1=data.fillna(inplace=False)

        City  Temp
0  Ahmedabad  34.0
1      Anand   NaN
2     Baroda   NaN
3      Surat  40.0
4      Delhi   NaN
5   Banglore  45.0

#### Axis

In [21]:
data=pd.read_csv('data_m.csv')
data.fillna(method='bfill',axis='columns')

      Name Marks Grades
0  Priyang    98    NaN
1   Aadhya    AB     AB
2   Krisha    99     AA
3   Vedant    87    NaN
4   Parshv    90     AC
5   Mittal    BA     BA
6  Archana    82     BB

#### Fill the first NaN element.

In [35]:
data.fillna(method='ffill',limit=1)

        City  Temp
0  Ahmedabad  34.0
1      Anand  34.0
2     Baroda   NaN
3      Surat  40.0
4      Delhi  40.0
5   Banglore  45.0

#### downcast

In [36]:
df=pd.DataFrame({'a':[1,None]})
df

     a
0  1.0
1  NaN

In [37]:
df1=df.fillna(0,downcast='infer')
df1

   a
0  1
1  0

In [38]:
df2=df.fillna({'a':0},downcast='infer')
df2

   a
0  1
1  0